select
 m010_cd           --社員コード
,a.m010_01            --氏名（姓）<-kysm010_pca.mp010_01
,a.m010_02            --氏名（名）<-kysm010_pca.mp010_02

,t100_01	--総支給額合計
,t100_02	--通勤費計
,t100_03	--支給 基本給
,t100_04	--支給 時間外手当(準職員　t100_32+t100_33+t100_34+t100_35+t100_36+t100_37)
,t100_05	--支給 前月清算
,t100_06	--支給 遡及差額
,t100_07	--健康保険料事業主
,t100_08	--介護保険料事業主
,t100_09	--厚生年金保険料事業主
,t100_10	--厚生年金基金保険料事業主
,t100_11	--雇用保険料
,t100_12	--児童（子育て拠出金）　<計算項目
,t100_13	--労災保険料事業主　<計算項目
,t100_14	--退手積立金の１／１２　<計算項目
,t100_15	--退任慰労金の１／１２(役員のみ)　<計算項目
--,m020_bucd		--部門コード(comm040) <-kysm010
,a.m020_bu			--部門名
--,m030_kubuncd	--区分コード(comm50)
,a.m030_kubun		--区分名
--,m040_yakucd		--役職コード(comt0010)
,a.m040_yaku		--役職名　
--,m050_sikakucd	--等級コード(comt0020)
,a.m050_sikaku		--等級名
,m010_update		--更新日(修正時更新)
,m010_tdate		--退職日   <-kysm010_pca取込時に反映
,m010_01		--氏名（姓）<-kysm010_pca.mp010_01
,m010_02		--氏名（名）<-kysm010_pca.mp010_02
,m010_03		--氏名フリガナ（姓）<-kysm010_pca.mp010_03
,m010_04		--氏名フリガナ（名）<-kysm010_pca.mp010_04
,m010_10		--生年月日(Read Only)
,t100_16		--支給 家族手当(職員)
,t100_17		--支給 法定内残業手当(準職員) -> 未使用
,t100_18		--支給 美唄炭鉱(職員)　役職(準職員)
,t100_19		--支給 営現手当(職員　 福井現場手当(準職員) ->法定内残業手当(準職員)
,t100_20		--支給 住宅手当(職員)
,t100_21		--支給 家賃額　<- 道営住宅時　借上社宅家賃（最大５万円）見合い(職員)
,t100_22		--支給 家賃控除　<- 道営住宅時　個人負担分２５％分マイナス(職員)
,t100_23		--支給 資格手当(職員)
,t100_24		--支給 単身手当(職員)
,t100_25		--支給 帰省補助(職員)　前月訂正(準職員)
,t100_26		--支給 待機手当(職員)
,t100_27		--支給 ライン職手当(職員)
,t100_28		--控除 親和会費(職員)
,t100_29		--控除 社宅料　<-借上社宅家賃（最大５万円）－借上社宅家賃（最大５万円）×７５％
,t100_30		--控除 住宅料　<-借上社宅家賃－借上社宅家賃（最大５万円）(職員)
,t100_31		--支給 報酬額（職員） 待機手当(準職員)
,t100_32		--支給 残業平日普通(準職員)
,t100_33		--支給 残業平日深夜(準職員)
,t100_34		--支給 残業休日普通(準職員)
,t100_35		--支給 残業休日深夜(準職員)
,t100_36		--支給 残業法定普通(準職員)
,t100_37		--支給 残業法定深夜(準職員)
,t100_tym	--給与年月
,ts170.ts170_12			--総合評価ランク(0:査定外,1:A,2:B,3:C,4:D,5:E)
,ts170.ts170_23			--入社日
,ts170.ts170_24			--昇格日
,ts170.ts170_25			--家族手当（管理職のみ）

 from kyst100 a
 left join kysts170 ts170 on a.m010_cd=ts170.m010_cd and ts170_y=2019

 left join kysm020 b on a.m020_bucd=b.m020_bucd
 left join kysm030 c on a.m020_bucd=c.m020_bucd and a.m030_kubuncd=c.m030_kubuncd
 left join kysm040 d on a.m040_yakucd=d.m040_yakucd
 left join kysm050 e on a.m050_sikakucd=e.m050_sikakucd

 where t100_ym='2019/06'
 and a.m010_kbn=0
 and m010_tdate is null
 order by b.m020_od,c.m030_od,d.m040_od,e.m050_od,a.m010_10

